---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RevolutionEndAngle
source: html/d767410c-f9a3-4eaa-0a0a-28d4f077fcde.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RevolutionEndAngle Property

"End Angle"

## Syntax (C#)
```csharp
public static ForgeTypeId RevolutionEndAngle { get; }
```